{
  "title": "Incidence Matrix",
  "htmlDescription": "<section id=\"description\">\n<p>Yet another way to represent a graph is to put it in an <dfn>incidence matrix.</dfn></p>\n<p>An <dfn>incidence matrix</dfn> is a two-dimensional (2D) array. Generally speaking, an incidence matrix relates two different classes of objects between its two dimensions. This kind of matrix is similar to an adjacency matrix. However, the rows and columns mean something else here.</p>\n<p>In graphs, we have edges and nodes. These will be our \"two different classes of objects\". This matrix will have the rows be the nodes and columns be the edges. This means that we can have an uneven number of rows and columns.</p>\n<p>Each column will represent a unique edge. Also, each edge connects two nodes. To show that there is an edge between two nodes, you will put a 1 in the two rows of a particular column. Below is a 3 node graph with one edge between node 1 and node 3.</p>\n<blockquote>    1<br>   ---<br>1 | 1<br>2 | 0<br>3 | 1</blockquote>\n<p>Here is an example of an <code>incidence matrix</code> with 4 edges and 4 nodes. Remember, the columns are the edges and rows are the nodes themselves.</p>\n<blockquote>    1 2 3 4<br>   --------<br>1 | 0 1 1 1<br>2 | 1 1 0 0<br>3 | 1 0 0 1<br>4 | 0 0 1 0</blockquote>\n<p>Below is a JavaScript implementation of the same thing.</p>\n<pre><code class=\"language-js\">var incMat = [\n  [0, 1, 1, 1],\n  [1, 1, 0, 0],\n  [1, 0, 0, 1],\n  [0, 0, 1, 0]\n];\n</code></pre>\n<p>To make a directed graph, use <code>-1</code> for an edge leaving a particular node and <code>1</code> for an edge entering a node.</p>\n<pre><code class=\"language-js\">var incMatDirected = [\n  [ 0, -1,  1, -1],\n  [-1,  1,  0,  0],\n  [ 1,  0,  0,  1],\n  [ 0,  0, -1,  0]\n];\n</code></pre>\n<p>Graphs can also have <dfn>weights</dfn> on their edges. So far, we have <dfn>unweighted</dfn> edges where just the presence and lack of edge is binary (<code>0</code> or <code>1</code>). You can have different weights depending on your application. A different weight is represented as numbers greater than 1.</p>\n</section>",
  "boilerplate": "var incMatUndirected = [\n\n];",
  "url": "https://www.freecodecamp.org/learn/coding-interview-prep/data-structures/incidence-matrix"
}