{
  "title": "Create a Hash Table",
  "htmlDescription": "<section id=\"description\">\n<p>In this challenge we will learn about hash tables. A Hash table is used to implement associative arrays, or mappings of key-value pairs, like the objects and Maps we have just been studying. A JavaScript object could be implemented as a hash table, for instance (its actual implementation will depend on the environment it's running in). The way a hash table works is that it takes a key input and hashes this key in a deterministic way to some numerical value. This numerical value is then used as the actual key the associated value is stored by. Then, if you try to access the same key again, the hashing function will process the key, return the same numerical result, which will then be used to look up the associated value. This provides very efficient O(1) lookup time on average.</p>\n<p>Hash tables can be implemented as arrays with hash functions producing array indices within a specified range. In this method, the choice of the array size is important, as is the hashing function. For instance, what if the hashing function produces the same value for two different keys? This is called a collision. One way to handle collisions is to just store both key-value pairs at that index. Then, upon lookup of either, you would have to iterate through the bucket of items to find the key you are looking for. A good hashing function will minimize collisions to maintain efficient search time.</p>\n<p>Here, we won't be concerned with the details of hashing or hash table implementation, we will just try to get a general sense of how they work.</p>\n</section>",
  "boilerplate": "var called = 0;\nvar hash = string => {\n  called++;\n  var hashed = 0;\n  for (var i = 0; i < string.length; i++) {\n    hashed += string.charCodeAt(i);\n  }\n  return hashed;\n};\nvar HashTable = function() {\n  this.collection = {};\n  // Only change code below this line\n  \n  // Only change code above this line\n};",
  "url": "https://www.freecodecamp.org/learn/coding-interview-prep/data-structures/create-a-hash-table"
}